package WordNet.App;

import WordNet.Database.DBConnection;

import java.sql.Connection;
import java.sql.PreparedStatement;
import java.sql.SQLException;

/**
 * Created by hiran on 11/2/16.
 */
public class Split {


    private String s = "පාකිස්තාන කණ්ඩායම හා බටහිර ඉන්දීය කොදෙව් කණ්ඩායම අතර එක්සත් අරාබි එමීර් රාජ්\u200Dයයේ පැවැත්වෙන තෙවැනි හා අවසන් ටෙස්ට් ක්\u200Dරිකට් තරගයේ සිවුවැනි දිනට තරගය ඊයේ (02දා) නතර කරනවිට ලකුණු 153ක ජයග්\u200Dරාහී ඉලක්කයක් හඹා යමින් සිටි කොදෙව් කණ්ඩායම කඩුලු 05ක් දැවී ලකුණු 114ක් රැස්කරගෙන සිටියේය. ඒ අනුව ජයග්\u200Dරහණය සඳහා අද (03දා) දිනයේදී ඔවුන් ලකුණු 39ක් රැස්කළ යුතුව ඇති අතර, ඒ සඳහා කඩුලු 05ක් ඔවුන් අතැතිව ඇත.\n" +
            "\n" +
            "පාකිස්තානු කණ්ඩායමේ සත්කාරකත්වය යටතේ සාජා ක්\u200Dරිකට් ක්\u200Dරීඩාංගණයේ පැවැත්වෙන මෙම තරගය පසුගිය ඉරිදා (30දා) ආරම්භ වූ අතර, පළමුව පන්දුවට පහරදුන් පාකිස්තාන කණ්ඩායම සිය පළමු ඉනිමට සියල්ලන් දැවී ලකුණු 281ක් රැස්කිරීමට සමත්විය. සාමි අස්ලම් (74), යුනිස් ඛාන් (51), මිස්බා උල් හක් (53) හා සර්ෆරාස් අහමඩ් (51) අර්ධ ශතක රැස්කරමින් පන්දුවට පහරදීමනේ දක්\u200Dෂතා දැක්වූහ. කෙදෙව්වන් වෙනුවෙන් දේවෙන්ද්\u200Dර බිෂෝ (4/77), ශනොන් ගේබ්\u200Dරියල් (3/67) හා අල්සාරි ජෝශප් (2/57) පන්දු යැවීමෙන් දක්\u200Dෂතා දැක්වූහ.\n" +
            "\n" +
            "පිළිතුරු ඉනිම ක්\u200Dරීඩාකළ කොදෙව් කණ්ඩායම සිය පළමු ඉනිමට සියල්ලන් දැවී ලකුණු 337ක් රැස්කළේය. මෙහිදි විශිෂ්ට ඉනිමක් ක්\u200Dරීඩාකළ ආරම්භක පිතිකරු ක්\u200Dරෙග් බ්\u200Dරැත්වේට් නොදැවී ලකුණු 142ක් තම කණ්ඩායමට එක්කිරීමට වගබලාගත්හ. ඔහුට අමතරව රොස්ටන් චේස් ලකුණු 50ක් රැස්කළේය. වයබ් රියාස් ලකුණු 85කට කඩුලු 05ක් දවාලමින් කොදෙව් ඉනිමට යම් අභියෝගයක් ක\u200Dළේය.\n" +
            "\n" +
            "ඉන් අනතුරුව ලකුණු 37ක් පසුපසින් සිටිමින් පාකිස්තාන කණ්ඩායම යළි දෙවැනි ඉනිම ඇරඹූ අතර, එහිදී ඔවුන්ට සියල්ලන් දැවී රැස්කළ හැකිවූයේ ලකුණු 208ක් පමණි. මෙහිදී සාර්ථක වූ අසාර් අලි පමණක් ලකුණු 91ක් රැස්කළේය. කොදෙව්වන් වෙනුවෙන් සාර්ථක පන්දු යැවීමක නිරත වූ නායක ජේසන් හෝල්ඩර් ලකුණු 30කට කඩුලු 05ක් දවාලූ අතර, දේවෙන්ද්\u200Dර බිෂෝ කඩුලු 03ක් බිඳලීය.\n" +
            "\n" +
            "ඒ අනුව කොදෙව් කණ්ඩායමට ලකුණු 153ක පහසු ඉලක්කයක් හිමිවූ අතර, මේ වනවිට එම ඉලක්කයට ලගාවෙමින් සිටින ඔවුන් කඩුලු 05ක් දැවී ලකුණු 114ක් රැස්කරගෙන සිටියි.\n" +
            "\n" +
            "කෙසේ නමුත් තරග තුනකින් සමන්විත මෙම ටෙස්ට් තරගාවලිය මේ වනවිට කොදෙව්වන් පරාජය වි ඇති අතර, පෙර පැවති තරග දෙකම ඔවුන් පාකිස්තානය හමුවේ පරාජය විය.";

    String[] a;

    void spiltString() {
        if (s.contains(".")) {
            a = s.split("\\.");
        } else {
            a = s.split("\\r?\\n");
        }
    }

    private int id = 0;

    void print() {
        System.out.println(a.length);
        for (String j : a) {
            System.out.println(j + "\n");
            id++;
            try {
                String sql = "Insert into sentence values(?,?)";
                Connection connection = DBConnection.getConnection();
                PreparedStatement stm = connection.prepareStatement(sql);
                stm.setObject(1, id);
                stm.setObject(2, j);
                int res = stm.executeUpdate();
                if (res > 0) {
                    System.out.println("Added " + id);
                }
            } catch (ClassNotFoundException ex) {
                System.out.println(ex.getMessage());
            } catch (SQLException ex) {
                System.out.println(ex.getMessage());
            }

        }

    }

    public static void main(String[] args) {
        Split split = new Split();

        split.spiltString();
        split.print();
    }
}
